zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_sg00/atdf/PIC32CK1025SG00144.atdf
          <instance name="SERCOM6">
            <register-group name="SERCOM6" name-in-module="SERCOM" address-space="base" offset="0x45004000"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA00" ioset="2"/>
              <signal group="PAD" index="0" function="D" pad="PA18" ioset="3"/>
              <signal group="PAD" index="0" function="C" pad="PA07" ioset="1"/>
              <signal group="PAD" index="1" function="D" pad="PA01" ioset="2"/>
              <signal group="PAD" index="1" function="D" pad="PA28" ioset="3"/>
              <signal group="PAD" index="1" function="C" pad="PA08" ioset="1"/>
              <signal group="PAD" index="2" function="D" pad="PA02" ioset="2"/>
              <signal group="PAD" index="2" function="D" pad="PA19" ioset="3"/>
              <signal group="PAD" index="2" function="C" pad="PA09" ioset="1"/>
              <signal group="PAD" index="3" function="D" pad="PA03" ioset="2"/>
              <signal group="PAD" index="3" function="D" pad="PA09" ioset="3"/>
              <signal group="PAD" index="3" function="C" pad="PA10" ioset="1"/>
            </signals>
            <parameters>
              <param name="CLK_REDUCTION" value="1" caption="Reduce clock options to pin 1 for SPI and USART"/>
              <param name="DMA" value="1" caption="DMA support implemented?"/>
              <param name="DMAC_ID_RX" value="45" caption="Index of DMA RX trigger"/>
              <param name="DMAC_ID_TX" value="46" caption="Index of DMA TX trigger"/>
              <param name="FIFO_IMPLEMENTED" value="1" caption="FIFO Rx/Tx implemented?"/>
              <param name="FIFO_SIZE" value="8" caption="Rx-Tx FIFO size in bytes"/>
              <param name="FSYNC_IMPLEMENTED" value="1" caption="SPI Frame Synch mode implemented?"/>
              <param name="GCLK_ID_CORE" value="27"/>
              <param name="GCLK_ID_SLOW" value="18"/>
              <param name="SPI" value="1" caption="SPI mode implemented?"/>
              <param name="TWIM" value="1" caption="TWI Master mode implemented?"/>
              <param name="TWIS" value="1" caption="TWI Slave mode implemented?"/>
              <param name="TWI_HSMODE" value="1" caption="TWI HighSpeed mode implemented?"/>
              <param name="ULTRA_IMPLEMENTATION" value="0" caption="ULTRA platform compatibility?"/>
              <param name="USART" value="1" caption="USART mode implemented?"/>
              <param name="USART_AUTOBAUD" value="1" caption="USART autobaud implemented?"/>
              <param name="USART_IRDA" value="1" caption="USART IrDA implemented?"/>
              <param name="USART_ISO7816" value="1" caption="USART ISO7816 mode implemented?"/>
              <param name="USART_LIN_MASTER" value="1" caption="USART LIN Master mode implemented?"/>
              <param name="USART_RS485" value="1" caption="USART RS485 mode implemented?"/>
              <param name="INSTANCE_ID" value="66" caption="Instance index for SERCOM6"/>
              <param name="MCLK_ID_APB" value="98" caption="Index for SERCOM6 APB clock"/>
              <param name="PAC_ID" value="66" caption="Index for SERCOM6 registers write protection"/>
              <param name="USART_ERROR_INT_SRC" value="108" caption="USART/SPI/I2C Error"/>
              <param name="USART_TX_READY_INT_SRC" value="109" caption="USART-SPI Data Register Empty/ I2C Stop Received"/>
              <param name="USART_TX_COMPLETE_INT_SRC" value="110" caption="USART-SPI Transmit Complete/ I2C Address Match"/>
              <param name="USART_RX_INT_SRC" value="111" caption="USART-SPI Receive Complete/ I2C Data Ready"/>
              <param name="SPI_TX_READY_INT_SRC" value="109" caption="USART-SPI Data Register Empty/ I2C Stop Received"/>
              <param name="SPI_TX_COMPLETE_INT_SRC" value="110" caption="USART-SPI Transmit Complete/ I2C Address Match"/>
              <param name="SPI_RX_INT_SRC" value="111" caption="USART-SPI Receive Complete/ I2C Data Ready"/>
              <param name="I2C_0_INT_SRC" value="108" caption="USART/SPI/I2C Error"/>
              <param name="I2C_1_INT_SRC" value="111" caption="USART-SPI Receive Complete/ I2C Data Ready"/>
              <param name="I2C_2_INT_SRC" value="112" caption="USART Receive Start/ SPI Slave Select Low/ I2C TX FIFO Empty"/>
              <param name="I2C_3_INT_SRC" value="113" caption="USART Clear To Send Input Change/ I2C RX FIFO Full"/>
            </parameters>
          </instance>
          <instance name="SERCOM7">
            <register-group name="SERCOM7" name-in-module="SERCOM" address-space="base" offset="0x45006000"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA12" ioset="3"/>
              <signal group="PAD" index="0" function="D" pad="PB18" ioset="4"/>
              <signal group="PAD" index="0" function="C" pad="PA21" ioset="2"/>
              <signal group="PAD" index="0" function="C" pad="PA01" ioset="1"/>
              <signal group="PAD" index="1" function="D" pad="PA11" ioset="3"/>
              <signal group="PAD" index="1" function="D" pad="PB12" ioset="4"/>
              <signal group="PAD" index="1" function="C" pad="PA04" ioset="1"/>
              <signal group="PAD" index="1" function="C" pad="PA20" ioset="2"/>
              <signal group="PAD" index="2" function="D" pad="PB00" ioset="3"/>
              <signal group="PAD" index="2" function="D" pad="PB19" ioset="4"/>
              <signal group="PAD" index="2" function="C" pad="PA05" ioset="1"/>
              <signal group="PAD" index="2" function="C" pad="PA22" ioset="2"/>
              <signal group="PAD" index="3" function="D" pad="PB01" ioset="3"/>
              <signal group="PAD" index="3" function="D" pad="PB20" ioset="4"/>
              <signal group="PAD" index="3" function="C" pad="PA06" ioset="1"/>
              <signal group="PAD" index="3" function="C" pad="PA23" ioset="2"/>
            </signals>
            <parameters>
              <param name="CLK_REDUCTION" value="1" caption="Reduce clock options to pin 1 for SPI and USART"/>
              <param name="DMA" value="1" caption="DMA support implemented?"/>
              <param name="DMAC_ID_RX" value="47" caption="Index of DMA RX trigger"/>
              <param name="DMAC_ID_TX" value="48" caption="Index of DMA TX trigger"/>
              <param name="FIFO_IMPLEMENTED" value="1" caption="FIFO Rx/Tx implemented?"/>
              <param name="FIFO_SIZE" value="8" caption="Rx-Tx FIFO size in bytes"/>
              <param name="FSYNC_IMPLEMENTED" value="1" caption="SPI Frame Synch mode implemented?"/>
              <param name="GCLK_ID_CORE" value="28"/>
              <param name="GCLK_ID_SLOW" value="18"/>
              <param name="SPI" value="1" caption="SPI mode implemented?"/>
              <param name="TWIM" value="0" caption="TWI Master mode implemented?"/>
              <param name="TWIS" value="0" caption="TWI Slave mode implemented?"/>
              <param name="TWI_HSMODE" value="0" caption="TWI HighSpeed mode implemented?"/>
              <param name="ULTRA_IMPLEMENTATION" value="0" caption="ULTRA platform compatibility?"/>
              <param name="USART" value="1" caption="USART mode implemented?"/>
              <param name="USART_AUTOBAUD" value="1" caption="USART autobaud implemented?"/>
              <param name="USART_IRDA" value="1" caption="USART IrDA implemented?"/>
              <param name="USART_ISO7816" value="1" caption="USART ISO7816 mode implemented?"/>
              <param name="USART_LIN_MASTER" value="1" caption="USART LIN Master mode implemented?"/>
              <param name="USART_RS485" value="1" caption="USART RS485 mode implemented?"/>
              <param name="INSTANCE_ID" value="67" caption="Instance index for SERCOM7"/>
              <param name="MCLK_ID_APB" value="99" caption="Index for SERCOM7 APB clock"/>
              <param name="PAC_ID" value="67" caption="Index for SERCOM7 registers write protection"/>
              <param name="USART_ERROR_INT_SRC" value="114" caption="USART/SPI/I2C Error"/>
              <param name="USART_TX_READY_INT_SRC" value="115" caption="USART-SPI Data Register Empty/ I2C Stop Received"/>
              <param name="USART_TX_COMPLETE_INT_SRC" value="116" caption="USART-SPI Transmit Complete/ I2C Address Match"/>
              <param name="USART_RX_INT_SRC" value="117" caption="USART-SPI Receive Complete/ I2C Data Ready"/>
              <param name="SPI_TX_READY_INT_SRC" value="115" caption="USART-SPI Data Register Empty/ I2C Stop Received"/>
              <param name="SPI_TX_COMPLETE_INT_SRC" value="116" caption="USART-SPI Transmit Complete/ I2C Address Match"/>
              <param name="SPI_RX_INT_SRC" value="117" caption="USART-SPI Receive Complete/ I2C Data Ready"/>
              <param name="I2C_0_INT_SRC" value="114" caption="USART/SPI/I2C Error"/>
              <param name="I2C_1_INT_SRC" value="117" caption="USART-SPI Receive Complete/ I2C Data Ready"/>
              <param name="I2C_2_INT_SRC" value="118" caption="USART Receive Start/ SPI Slave Select Low/ I2C TX FIFO Empty"/>
              <param name="I2C_3_INT_SRC" value="119" caption="USART Clear To Send Input Change/ I2C RX FIFO Full"/>
            </parameters>
          </instance>
        </module>
        <module name="SPI_IXS" id="03574" name2="spi_ixs_apb_v1" version="1a0">
          <instance name="SPI_IXS">
            <register-group name="SPI_IXS" name-in-module="SPI_IXS" address-space="base" offset="0x45016000"/>
            <signals>
              <signal group="FSYNC" function="J" pad="PA09" ioset="2"/>
              <signal group="FSYNC" function="J" pad="PD06" ioset="1"/>
              <signal group="FSYNC" function="J" pad="PD13" ioset="3"/>
              <signal group="SCK" function="J" pad="PA11" ioset="2"/>
              <signal group="SCK" function="J" pad="PD10" ioset="1"/>
              <signal group="SCK" function="J" pad="PD14" ioset="3"/>
              <signal group="SDI" function="J" pad="PA12" ioset="2"/>
              <signal group="SDI" function="J" pad="PD07" ioset="1"/>
              <signal group="SDI" function="J" pad="PD16" ioset="3"/>
              <signal group="SDO" function="J" pad="PB00" ioset="2"/>
              <signal group="SDO" function="J" pad="PD08" ioset="1"/>
              <signal group="SDO" function="J" pad="PD17" ioset="3"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="65"/>
              <param name="DMAC_ID_TX" value="66"/>
              <param name="GCLK_ID" value="36" caption="Index of Generic Clock"/>
              <param name="TPD_MASTER" value="0" caption="Indicates a master or slave number for TPD mode( 1=master,0=slave)"/>
              <param name="INSTANCE_ID" value="75" caption="Instance index for SPI_IXS"/>
              <param name="MCLK_ID_APB" value="107" caption="Index for SPI_IXS APB clock"/>
              <param name="PAC_ID" value="75" caption="Index for SPI_IXS registers write protection"/>
            </parameters>
          </instance>
        </module>
