zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_sg00/atdf/PIC32CK1025SG00144.atdf
      </peripherals>
      <interrupts>
        <interrupt name="Reset" index="-15" caption="Reset Vector, invoked on Power up and warm reset"/>
        <interrupt name="NonMaskableInt" index="-14" caption="Non maskable Interrupt, cannot be stopped or preempted"/>
        <interrupt name="HardFault" index="-13" caption="Hard Fault, all classes of Fault"/>
        <interrupt name="MemoryManagement" index="-12" caption="Memory Management, MPU mismatch, including Access Violation and No Match"/>
        <interrupt name="BusFault" index="-11" caption="Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault"/>
        <interrupt name="UsageFault" index="-10" caption="Usage Fault, i.e. Undef Instruction, Illegal State Transition"/>
        <interrupt name="SecureFaultMonitor" index="-9" caption="Secure Fault"/>
        <interrupt name="SVCall" index="-5" caption="System Service Call via SVC instruction"/>
        <interrupt name="DebugMonitor" index="-4" caption="Debug Monitor"/>
        <interrupt name="PendSV" index="-2" caption="Pendable request for system service"/>
        <interrupt name="SysTick" index="-1" caption="System Tick Timer"/>
        <interrupt name="FCR_ERR" index="0" module-instance="FCR" caption="Flash Read Controller ECC Error"/>
        <interrupt name="FCR_FLT" index="1" module-instance="FCR" caption="Flash Read Controller CRC Fault"/>
        <interrupt name="FCW" index="2" module-instance="FCW" caption="Flash Write Controller Interrupt"/>
        <interrupt name="PM" index="3" module-instance="PM" caption="Power Manager"/>
        <interrupt name="SUPC" index="4" module-instance="SUPC" caption="Supply Controller"/>
        <interrupt name="OSCCTRL_XOSC" index="5" module-instance="OSCCTRL" caption="External Oscillator"/>
        <interrupt name="OSCCTRL_DFLL" index="6" module-instance="OSCCTRL" caption="DFLL"/>
        <interrupt name="OSCCTRL_PLL0" index="7" module-instance="OSCCTRL" caption="PLL"/>
        <interrupt name="OSC32KCTRL" index="8" module-instance="OSC32KCTRL" caption="32K Oscillator"/>
        <interrupt name="MCLK" index="9" module-instance="MCLK" caption="Main Clock"/>
        <interrupt name="FREQM" index="10" module-instance="FREQM" caption="Frequency Meter"/>
        <interrupt name="WDT" index="11" module-instance="WDT" caption="Watchdog Timer"/>
        <interrupt name="RTC" index="12" module-instance="RTC" caption="RTC"/>
        <interrupt name="EIC_EXTINT_0" index="13" module-instance="EIC" caption="External Interrupt 0"/>
        <interrupt name="EIC_EXTINT_1" index="14" module-instance="EIC" caption="External Interrupt 1"/>
        <interrupt name="EIC_EXTINT_2" index="15" module-instance="EIC" caption="External Interrupt 2"/>
        <interrupt name="EIC_EXTINT_3" index="16" module-instance="EIC" caption="External Interrupt 3"/>
        <interrupt name="EIC_EXTINT_4" index="17" module-instance="EIC" caption="External Interrupt 4"/>
        <interrupt name="EIC_EXTINT_5" index="18" module-instance="EIC" caption="External Interrupt 5"/>
        <interrupt name="EIC_EXTINT_6" index="19" module-instance="EIC" caption="External Interrupt 6"/>
        <interrupt name="EIC_EXTINT_7" index="20" module-instance="EIC" caption="External Interrupt 7"/>
        <interrupt name="EIC_EXTINT_8" index="21" module-instance="EIC" caption="External Interrupt 8"/>
        <interrupt name="EIC_EXTINT_9" index="22" module-instance="EIC" caption="External Interrupt 9"/>
        <interrupt name="EIC_EXTINT_10" index="23" module-instance="EIC" caption="External Interrupt 10"/>
        <interrupt name="EIC_EXTINT_11" index="24" module-instance="EIC" caption="External Interrupt 11"/>
        <interrupt name="EIC_EXTINT_12" index="25" module-instance="EIC" caption="External Interrupt 12"/>
        <interrupt name="EIC_EXTINT_13" index="26" module-instance="EIC" caption="External Interrupt 13"/>
        <interrupt name="EIC_EXTINT_14" index="27" module-instance="EIC" caption="External Interrupt 14"/>
        <interrupt name="EIC_EXTINT_15" index="28" module-instance="EIC" caption="External Interrupt 15"/>
        <interrupt name="EIC_NSCHK" index="29" module-instance="EIC" caption="External Interrupt Non-Secure Check"/>
        <interrupt name="PAC" index="30" module-instance="PAC" caption="Peripheral Access Controller"/>
        <interrupt name="TRAM" index="31" module-instance="TRAM" caption="Trust RAM Interrupt"/>
        <interrupt name="PORT" index="32" module-instance="PORT" caption="Port"/>
        <interrupt name="DMA0_PRI0" index="33" module-instance="DMA0" caption="DMA 0 Priority 0 Interrupt"/>
        <interrupt name="DMA0_PRI1" index="34" module-instance="DMA0" caption="DMA 0 Priority 1 Interrupt"/>
        <interrupt name="DMA0_PRI2" index="35" module-instance="DMA0" caption="DMA 0 Priority 2 Interrupt"/>
        <interrupt name="DMA1_PRI0" index="36" module-instance="DMA1" caption="DMA 1 Priority 0 Interrupt"/>
        <interrupt name="DMA1_PRI1" index="37" module-instance="DMA1" caption="DMA 1 Priority 1 Interrupt"/>
        <interrupt name="HMATRIX" index="38" module-instance="HMATRIX" caption="HMATRIX"/>
        <interrupt name="EVSYS_0" index="39" module-instance="EVSYS" caption="Event System Channel 0"/>
        <interrupt name="EVSYS_1" index="40" module-instance="EVSYS" caption="Event System Channel 1"/>
        <interrupt name="EVSYS_2" index="41" module-instance="EVSYS" caption="Event System Channel 2"/>
        <interrupt name="EVSYS_3" index="42" module-instance="EVSYS" caption="Event System Channel 3"/>
        <interrupt name="EVSYS_OTHER" index="43" module-instance="EVSYS" caption="Event System Channel 4..X"/>
        <interrupt name="SERCOM0_56" index="44" module-instance="SERCOM0" caption="Serial Communication Interface 0"/>
        <interrupt name="SERCOM0_0" index="45" module-instance="SERCOM0" caption="Serial Communication Interface 0"/>
        <interrupt name="SERCOM0_1" index="46" module-instance="SERCOM0" caption="Serial Communication Interface 0"/>
        <interrupt name="SERCOM0_2" index="47" module-instance="SERCOM0" caption="Serial Communication Interface 0"/>
        <interrupt name="SERCOM0_3" index="48" module-instance="SERCOM0" caption="Serial Communication Interface 0"/>
        <interrupt name="SERCOM0_4" index="49" module-instance="SERCOM0" caption="Serial Communication Interface 0"/>
        <interrupt name="SERCOM1_56" index="50" module-instance="SERCOM1" caption="Serial Communication Interface 1"/>
        <interrupt name="SERCOM1_0" index="51" module-instance="SERCOM1" caption="Serial Communication Interface 1"/>
        <interrupt name="SERCOM1_1" index="52" module-instance="SERCOM1" caption="Serial Communication Interface 1"/>
        <interrupt name="SERCOM1_2" index="53" module-instance="SERCOM1" caption="Serial Communication Interface 1"/>
        <interrupt name="SERCOM1_3" index="54" module-instance="SERCOM1" caption="Serial Communication Interface 1"/>
        <interrupt name="SERCOM1_4" index="55" module-instance="SERCOM1" caption="Serial Communication Interface 1"/>
        <interrupt name="SERCOM2_56" index="56" module-instance="SERCOM2" caption="Serial Communication Interface 2"/>
        <interrupt name="SERCOM2_0" index="57" module-instance="SERCOM2" caption="Serial Communication Interface 2"/>
        <interrupt name="SERCOM2_1" index="58" module-instance="SERCOM2" caption="Serial Communication Interface 2"/>
        <interrupt name="SERCOM2_2" index="59" module-instance="SERCOM2" caption="Serial Communication Interface 2"/>
        <interrupt name="SERCOM2_3" index="60" module-instance="SERCOM2" caption="Serial Communication Interface 2"/>
        <interrupt name="SERCOM2_4" index="61" module-instance="SERCOM2" caption="Serial Communication Interface 2"/>
        <interrupt name="SERCOM3_56" index="62" module-instance="SERCOM3" caption="Serial Communication Interface 3"/>
        <interrupt name="SERCOM3_0" index="63" module-instance="SERCOM3" caption="Serial Communication Interface 3"/>
        <interrupt name="SERCOM3_1" index="64" module-instance="SERCOM3" caption="Serial Communication Interface 3"/>
        <interrupt name="SERCOM3_2" index="65" module-instance="SERCOM3" caption="Serial Communication Interface 3"/>
        <interrupt name="SERCOM3_3" index="66" module-instance="SERCOM3" caption="Serial Communication Interface 3"/>
        <interrupt name="SERCOM3_4" index="67" module-instance="SERCOM3" caption="Serial Communication Interface 3"/>
        <interrupt name="TCC0_OTHER" index="68" module-instance="TCC0" caption="Error/Overflow/Underflow/Fault Interrupt"/>
        <interrupt name="TCC0_MC0" index="69" module-instance="TCC0" caption="TCC Match/Compare 0"/>
        <interrupt name="TCC0_MC1" index="70" module-instance="TCC0" caption="TCC Match/Compare 1"/>
        <interrupt name="TCC0_MC2" index="71" module-instance="TCC0" caption="TCC Match/Compare 2"/>
        <interrupt name="TCC0_MC3" index="72" module-instance="TCC0" caption="TCC Match/Compare 3"/>
        <interrupt name="TCC0_MC4" index="73" module-instance="TCC0" caption="TCC Match/Compare 4"/>
        <interrupt name="TCC0_MC5" index="74" module-instance="TCC0" caption="TCC Match/Compare 5"/>
        <interrupt name="TCC1_OTHER" index="75" module-instance="TCC1" caption="Error/Overflow/Underflow/Fault Interrupt"/>
        <interrupt name="TCC1_MC0" index="76" module-instance="TCC1" caption="TCC Match/Compare 0"/>
        <interrupt name="TCC1_MC1" index="77" module-instance="TCC1" caption="TCC Match/Compare 1"/>
        <interrupt name="TCC1_MC2" index="78" module-instance="TCC1" caption="TCC Match/Compare 2"/>
        <interrupt name="TCC1_MC3" index="79" module-instance="TCC1" caption="TCC Match/Compare 3"/>
        <interrupt name="TCC1_MC4" index="80" module-instance="TCC1" caption="TCC Match/Compare 4"/>
        <interrupt name="TCC1_MC5" index="81" module-instance="TCC1" caption="TCC Match/Compare 5"/>
        <interrupt name="TCC2_OTHER" index="82" module-instance="TCC2" caption="Error/Overflow/Underflow/Fault Interrupt"/>
        <interrupt name="TCC2_MC0" index="83" module-instance="TCC2" caption="TCC Match/Compare 0"/>
        <interrupt name="TCC2_MC1" index="84" module-instance="TCC2" caption="TCC Match/Compare 1"/>
        <interrupt name="TCC2_MC2" index="85" module-instance="TCC2" caption="TCC Match/Compare 2"/>
        <interrupt name="TCC2_MC3" index="86" module-instance="TCC2" caption="TCC Match/Compare 3"/>
        <interrupt name="TCC2_MC4" index="87" module-instance="TCC2" caption="TCC Match/Compare 4"/>
        <interrupt name="TCC2_MC5" index="88" module-instance="TCC2" caption="TCC Match/Compare 5"/>
        <interrupt name="TCC3_OTHER" index="89" module-instance="TCC3" caption="Error/Overflow/Underflow/Fault Interrupt"/>
        <interrupt name="TCC3_MC0" index="90" module-instance="TCC3" caption="TCC Match/Compare 0"/>
        <interrupt name="TCC3_MC1" index="91" module-instance="TCC3" caption="TCC Match/Compare 1"/>
        <interrupt name="TCC3_MC2" index="92" module-instance="TCC3" caption="TCC Match/Compare 2"/>
        <interrupt name="TCC3_MC3" index="93" module-instance="TCC3" caption="TCC Match/Compare 3"/>
        <interrupt name="TCC3_MC4" index="94" module-instance="TCC3" caption="TCC Match/Compare 4"/>
        <interrupt name="TCC3_MC5" index="95" module-instance="TCC3" caption="TCC Match/Compare 5"/>
        <interrupt name="SERCOM4_56" index="96" module-instance="SERCOM4" caption="Serial Communication Interface 4"/>
        <interrupt name="SERCOM4_0" index="97" module-instance="SERCOM4" caption="Serial Communication Interface 4"/>
        <interrupt name="SERCOM4_1" index="98" module-instance="SERCOM4" caption="Serial Communication Interface 4"/>
        <interrupt name="SERCOM4_2" index="99" module-instance="SERCOM4" caption="Serial Communication Interface 4"/>
        <interrupt name="SERCOM4_3" index="100" module-instance="SERCOM4" caption="Serial Communication Interface 4"/>
        <interrupt name="SERCOM4_4" index="101" module-instance="SERCOM4" caption="Serial Communication Interface 4"/>
        <interrupt name="SERCOM5_56" index="102" module-instance="SERCOM5" caption="Serial Communication Interface 5"/>
        <interrupt name="SERCOM5_0" index="103" module-instance="SERCOM5" caption="Serial Communication Interface 5"/>
        <interrupt name="SERCOM5_1" index="104" module-instance="SERCOM5" caption="Serial Communication Interface 5"/>
        <interrupt name="SERCOM5_2" index="105" module-instance="SERCOM5" caption="Serial Communication Interface 5"/>
        <interrupt name="SERCOM5_3" index="106" module-instance="SERCOM5" caption="Serial Communication Interface 5"/>
        <interrupt name="SERCOM5_4" index="107" module-instance="SERCOM5" caption="Serial Communication Interface 5"/>
        <interrupt name="SERCOM6_56" index="108" module-instance="SERCOM6" caption="Serial Communication Interface 6"/>
        <interrupt name="SERCOM6_0" index="109" module-instance="SERCOM6" caption="Serial Communication Interface 6"/>
        <interrupt name="SERCOM6_1" index="110" module-instance="SERCOM6" caption="Serial Communication Interface 6"/>
        <interrupt name="SERCOM6_2" index="111" module-instance="SERCOM6" caption="Serial Communication Interface 6"/>
        <interrupt name="SERCOM6_3" index="112" module-instance="SERCOM6" caption="Serial Communication Interface 6"/>
        <interrupt name="SERCOM6_4" index="113" module-instance="SERCOM6" caption="Serial Communication Interface 6"/>
        <interrupt name="SERCOM7_56" index="114" module-instance="SERCOM7" caption="Serial Communication Interface 7"/>
        <interrupt name="SERCOM7_0" index="115" module-instance="SERCOM7" caption="Serial Communication Interface 7"/>
        <interrupt name="SERCOM7_1" index="116" module-instance="SERCOM7" caption="Serial Communication Interface 7"/>
        <interrupt name="SERCOM7_2" index="117" module-instance="SERCOM7" caption="Serial Communication Interface 7"/>
        <interrupt name="SERCOM7_3" index="118" module-instance="SERCOM7" caption="Serial Communication Interface 7"/>
        <interrupt name="SERCOM7_4" index="119" module-instance="SERCOM7" caption="Serial Communication Interface 7"/>
        <interrupt name="TCC4_OTHER" index="120" module-instance="TCC4" caption="Error/Overflow/Underflow/Fault Interrupt"/>
        <interrupt name="TCC4_MC0" index="121" module-instance="TCC4" caption="TCC Match/Compare 0"/>
        <interrupt name="TCC4_MC1" index="122" module-instance="TCC4" caption="TCC Match/Compare 1"/>
        <interrupt name="TCC5_OTHER" index="123" module-instance="TCC5" caption="Error/Overflow/Underflow/Fault Interrupt"/>
        <interrupt name="TCC5_MC0" index="124" module-instance="TCC5" caption="TCC Match/Compare 0"/>
        <interrupt name="TCC5_MC1" index="125" module-instance="TCC5" caption="TCC Match/Compare 1"/>
        <interrupt name="TCC6_OTHER" index="126" module-instance="TCC6" caption="Error/Overflow/Underflow/Fault Interrupt"/>
        <interrupt name="TCC6_MC0" index="127" module-instance="TCC6" caption="TCC Match/Compare 0"/>
        <interrupt name="TCC6_MC1" index="128" module-instance="TCC6" caption="TCC Match/Compare 1"/>
        <interrupt name="TCC7_OTHER" index="129" module-instance="TCC7" caption="Error/Overflow/Underflow/Fault Interrupt"/>
        <interrupt name="TCC7_MC0" index="130" module-instance="TCC7" caption="TCC Match/Compare 0"/>
        <interrupt name="TCC7_MC1" index="131" module-instance="TCC7" caption="TCC Match/Compare 1"/>
        <interrupt name="ADC_GLOBAL" index="132" module-instance="ADC" caption="ADC Global Interrupt"/>
        <interrupt name="ADC_CORE1" index="133" module-instance="ADC" caption="ADC Core 1 Interrupt"/>
        <interrupt name="Reserved2" index="134" module-instance="ADC" caption="ADC Unused/Reserved"/>
        <interrupt name="Reserved3" index="135" module-instance="ADC" caption="ADC Unused/Reserved"/>
        <interrupt name="Reserved4" index="136" module-instance="ADC" caption="ADC Unused/Reserved"/>
        <interrupt name="Reserved5" index="137" module-instance="ADC" caption="ADC Unused/Reserved"/>
        <interrupt name="AC" index="138" module-instance="AC" caption="Analog Comparator Interrupt"/>
        <interrupt name="PTC" index="139" module-instance="PTC" caption="Peripheral Touch Controller"/>
        <interrupt name="SPI_IXS" index="140" module-instance="SPI_IXS" caption="Audio SPI Interrupt"/>
        <interrupt name="PCC" index="141" module-instance="PCC" caption="PCC"/>
        <interrupt name="PDEC" index="142" module-instance="PDEC" caption="PDEC"/>
        <interrupt name="Reserved6" index="143" module-instance="CAN0" caption="Controller Area Network 0 Unused/Reserved"/>
        <interrupt name="Reserved7" index="144" module-instance="CAN1" caption="Controller Area Network 1 Unused/Reserved"/>
        <interrupt name="ETH" index="145" module-instance="ETH" caption="Ethernet MAC Interrupt"/>
        <interrupt name="SQI" index="146" module-instance="SQI" caption="Quad SPI Interrupt"/>
        <interrupt name="TRNG" index="147" module-instance="TRNG" caption="True Random Generator"/>
        <interrupt name="SDMMC0" index="148" module-instance="SDMMC0" caption="SD/MMC Host Controller Interrupt 0"/>
        <interrupt name="SDMMC1" index="149" module-instance="SDMMC1" caption="SD/MMC Host Controller Interrupt 1"/>
        <interrupt name="USB_OTHER" index="150" module-instance="USB" caption="USB Other Interrupt"/>
        <interrupt name="USB_SOF" index="151" module-instance="USB" caption="USB SOF Interrupt"/>
        <interrupt name="USB_TRCPT0" index="152" module-instance="USB" caption="USB TRCPT0 Interrupt"/>
        <interrupt name="USB_TRCPT1" index="153" module-instance="USB" caption="USB TRCPT1 Interrupt"/>
        <interrupt name="USBHS" index="154" module-instance="USBHS" caption="High Speed USB Interrupt"/>
        <interrupt name="HSM_ERROR" index="155" module-instance="HSM" caption="Hardware Security Module Error Interrupt"/>
        <interrupt name="HSM_TXINT" index="156" module-instance="HSM" caption="Hardware Security Module Transmit Interrupt"/>
        <interrupt name="HSM_RXINT" index="157" module-instance="HSM" caption="Hardware Security Module Receive Interrupt"/>
      </interrupts>
      <events>
        <generators>
          <generator name="SUPC_LVDET" index="1" module-instance="SUPC"/>
          <generator name="OSCCTRL_XOSC_FAIL" index="2" module-instance="OSCCTRL"/>
          <generator name="OSC32KCTRL_XOSC32K_FAIL" index="3" module-instance="OSC32KCTRL"/>
          <generator name="FREQM_DONE" index="4" module-instance="FREQM"/>
          <generator name="FREQM_WINMON" index="5" module-instance="FREQM"/>
          <generator name="RTC_PER_0" index="6" module-instance="RTC"/>
          <generator name="RTC_PER_1" index="7" module-instance="RTC"/>
          <generator name="RTC_PER_2" index="8" module-instance="RTC"/>
          <generator name="RTC_PER_3" index="9" module-instance="RTC"/>
          <generator name="RTC_PER_4" index="10" module-instance="RTC"/>
          <generator name="RTC_PER_5" index="11" module-instance="RTC"/>
          <generator name="RTC_PER_6" index="12" module-instance="RTC"/>
          <generator name="RTC_PER_7" index="13" module-instance="RTC"/>
          <generator name="RTC_PERD" index="14" module-instance="RTC"/>
          <generator name="RTC_CMP_0" index="15" module-instance="RTC"/>
          <generator name="RTC_CMP_1" index="16" module-instance="RTC"/>
          <generator name="RTC_CMP_2" index="17" module-instance="RTC"/>
          <generator name="RTC_CMP_3" index="18" module-instance="RTC"/>
          <generator name="RTC_TAMPER" index="19" module-instance="RTC"/>
          <generator name="RTC_OVF" index="20" module-instance="RTC"/>
          <generator name="EIC_EXTINT_0" index="21" module-instance="EIC"/>
          <generator name="EIC_EXTINT_1" index="22" module-instance="EIC"/>
          <generator name="EIC_EXTINT_2" index="23" module-instance="EIC"/>
          <generator name="EIC_EXTINT_3" index="24" module-instance="EIC"/>
          <generator name="EIC_EXTINT_4" index="25" module-instance="EIC"/>
          <generator name="EIC_EXTINT_5" index="26" module-instance="EIC"/>
          <generator name="EIC_EXTINT_6" index="27" module-instance="EIC"/>
          <generator name="EIC_EXTINT_7" index="28" module-instance="EIC"/>
          <generator name="EIC_EXTINT_8" index="29" module-instance="EIC"/>
          <generator name="EIC_EXTINT_9" index="30" module-instance="EIC"/>
          <generator name="EIC_EXTINT_10" index="31" module-instance="EIC"/>
          <generator name="EIC_EXTINT_11" index="32" module-instance="EIC"/>
          <generator name="EIC_EXTINT_12" index="33" module-instance="EIC"/>
          <generator name="EIC_EXTINT_13" index="34" module-instance="EIC"/>
          <generator name="EIC_EXTINT_14" index="35" module-instance="EIC"/>
          <generator name="EIC_EXTINT_15" index="36" module-instance="EIC"/>
          <generator name="PAC_ACCERR" index="37" module-instance="PAC"/>
          <generator name="DMA0_CH_0" index="38" module-instance="DMA0"/>
          <generator name="DMA0_CH_1" index="39" module-instance="DMA0"/>
          <generator name="DMA0_CH_2" index="40" module-instance="DMA0"/>
          <generator name="DMA0_CH_3" index="41" module-instance="DMA0"/>
          <generator name="DMA0_CH_4" index="42" module-instance="DMA0"/>
          <generator name="DMA0_CH_5" index="43" module-instance="DMA0"/>
          <generator name="DMA0_CH_6" index="44" module-instance="DMA0"/>
          <generator name="DMA0_CH_7" index="45" module-instance="DMA0"/>
          <generator name="DMA1_CH_0" index="46" module-instance="DMA1"/>
          <generator name="DMA1_CH_1" index="47" module-instance="DMA1"/>
          <generator name="DMA1_CH_2" index="48" module-instance="DMA1"/>
          <generator name="DMA1_CH_3" index="49" module-instance="DMA1"/>
          <generator name="TCC0_OVF" index="50" module-instance="TCC0"/>
          <generator name="TCC0_TRG" index="51" module-instance="TCC0"/>
          <generator name="TCC0_CNT" index="52" module-instance="TCC0"/>
          <generator name="TCC0_MC_0" index="53" module-instance="TCC0"/>
          <generator name="TCC0_MC_1" index="54" module-instance="TCC0"/>
          <generator name="TCC0_MC_2" index="55" module-instance="TCC0"/>
          <generator name="TCC0_MC_3" index="56" module-instance="TCC0"/>
          <generator name="TCC0_MC_4" index="57" module-instance="TCC0"/>
          <generator name="TCC0_MC_5" index="58" module-instance="TCC0"/>
          <generator name="TCC1_OVF" index="59" module-instance="TCC1"/>
          <generator name="TCC1_TRG" index="60" module-instance="TCC1"/>
          <generator name="TCC1_CNT" index="61" module-instance="TCC1"/>
          <generator name="TCC1_MC_0" index="62" module-instance="TCC1"/>
          <generator name="TCC1_MC_1" index="63" module-instance="TCC1"/>
          <generator name="TCC1_MC_2" index="64" module-instance="TCC1"/>
          <generator name="TCC1_MC_3" index="65" module-instance="TCC1"/>
          <generator name="TCC1_MC_4" index="66" module-instance="TCC1"/>
          <generator name="TCC1_MC_5" index="67" module-instance="TCC1"/>
          <generator name="TCC2_OVF" index="68" module-instance="TCC2"/>
          <generator name="TCC2_TRG" index="69" module-instance="TCC2"/>
          <generator name="TCC2_CNT" index="70" module-instance="TCC2"/>
          <generator name="TCC2_MC_0" index="71" module-instance="TCC2"/>
          <generator name="TCC2_MC_1" index="72" module-instance="TCC2"/>
          <generator name="TCC2_MC_2" index="73" module-instance="TCC2"/>
          <generator name="TCC2_MC_3" index="74" module-instance="TCC2"/>
