zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_sg00/atdf/PIC32CK1025SG00144.atdf
      <value-group name="TCC_EVCTRL__CNTSEL">
        <value name="START" caption="An interrupt/event is generated when a new counter cycle starts" value="0"/>
        <value name="END" caption="An interrupt/event is generated when a counter cycle ends" value="1"/>
        <value name="BOUNDARY" caption="An interrupt/event is generated when a new counter cycle starts or a counter cycle ends" value="3"/>
      </value-group>
      <value-group name="TCC_WAVE__WAVEGEN">
        <value name="NFRQ" caption="Normal frequency" value="0"/>
        <value name="MFRQ" caption="Match frequency" value="1"/>
        <value name="NPWM" caption="Normal PWM" value="2"/>
        <value name="DPWM" caption="Dual compare PWM" value="3"/>
        <value name="DSCRITICAL" caption="Dual-slope critical" value="4"/>
        <value name="DSBOTTOM" caption="Dual-slope with interrupt/event condition when COUNT reaches ZERO" value="5"/>
        <value name="DSBOTH" caption="Dual-slope with interrupt/event condition when COUNT reaches ZERO or TOP" value="6"/>
        <value name="DSTOP" caption="Dual-slope with interrupt/event condition when COUNT reaches TOP" value="7"/>
      </value-group>
      <value-group name="TCC_WAVE__RAMP">
        <value name="RAMP1" caption="RAMP1 operation" value="0"/>
        <value name="RAMP2A" caption="Alternative RAMP2 operation" value="1"/>
        <value name="RAMP2" caption="RAMP2 operation" value="2"/>
        <value name="RAMP2C" caption="Critical RAMP2 operation" value="3"/>
        <value name="RAMP2CS" caption="Critical Swapped RAMP2 operation" value="4"/>
      </value-group>
    </module>
    <module name="TPIU" id="SYSTEM_IP" version="1.0.0" caption="Trace Port Interface Unit">
      <register-group name="TPIU" caption="Trace Port Interface Unit">
        <register name="SSPSR" offset="0x0" rw="RW" size="4" access-size="4" caption="TPIU Supported Parallel Port Sizes Register">
          <bitfield name="SWIDTH" caption="Supported widths - 1" mask="0xFFFFFFFF"/>
        </register>
        <register name="CSPSR" offset="0x4" rw="RW" size="4" access-size="4" caption="TPIU Current Parallel Port Sizes Register">
          <bitfield name="CWIDTH" caption="Current parallel trace port widthi - 1" mask="0xFFFFFFFF"/>
        </register>
        <register name="ACPR" offset="0x10" rw="RW" size="4" access-size="4" caption="TPIU Asynchronous Clock Prescaler Register">
          <bitfield name="SWOSCALER" caption="SWO baud rate prescaler" mask="0xFFFF"/>
        </register>
        <register name="SPPR" offset="0xF0" rw="RW" size="4" access-size="4" caption="TPIU Selected Pin Protocol Register">
          <bitfield name="TXMODE" caption="" mask="0x3" values="SPPR__TXMODE"/>
        </register>
        <register name="FFSR" offset="0x300" rw="R" size="4" access-size="4" caption="TPIU Formatter and Flush Status Register">
          <bitfield name="FInProg" caption="Flush in progress" mask="0x1"/>
          <bitfield name="FtStopped" caption="Formatter stopped" mask="0x2"/>
          <bitfield name="TCPresent" caption="TRACECTL pin is present" mask="0x4"/>
          <bitfield name="FtNonStop" caption="Non-stop formatter" mask="0x8"/>
        </register>
        <register name="FFCR" offset="0x304" rw="RW" size="4" access-size="4" initval="0x00000000" caption="TPIU Formatter and Flush Control Register">
          <bitfield name="EnFmt" caption="Output formatting mode" mask="0x3" values="FFCR__EnFmt"/>
          <bitfield name="FOnMan" caption="Flush On Manual" mask="0x40"/>
          <bitfield name="TrigIn" caption="Trigger input asserted" mask="0x100"/>
        </register>
        <register name="PSCR" offset="0x308" rw="RW" size="4" access-size="4" caption="TPIU Periodic Synchronization Control Register">
          <bitfield name="PSCount" caption="Periodic Synchronization Count" mask="0x1F"/>
        </register>
        <register name="LAR" offset="0xFB0" rw="W" size="4" access-size="4" caption="TPIU Software Lock Access Register">
          <bitfield name="KEY" caption="Lock access control" mask="0xFFFFFFFF" values="LAR__KEY"/>
        </register>
        <register name="LSR" offset="0xFB4" rw="R" size="4" access-size="4" caption="TPIU Software Lock Status Register">
          <bitfield name="SLI" caption="Software Lock implemented" mask="0x1"/>
          <bitfield name="SLK" caption="Software Lock status" mask="0x2"/>
          <bitfield name="nTT" caption="Not thirty-two bit" mask="0x4"/>
        </register>
        <register name="DEVID" offset="0xFC8" rw="R" size="4" access-size="4" caption="TPIU Device Identifier Register">
          <bitfield name="DWTENA" caption="" mask="0x1000000"/>
        </register>
        <register name="DEVTYPE" offset="0xFCC" rw="R" size="4" access-size="4" caption="TPIU Device Type Register">
          <bitfield name="MAJOR" caption="Major type" mask="0xF"/>
          <bitfield name="SUB" caption="Sub-type" mask="0xF0"/>
        </register>
        <register name="PIDR4" offset="0xFD0" rw="R" size="4" access-size="4" caption="TPIU Peripheral Identification Register 4">
          <bitfield name="DES_2" caption="JEP106 continuation code" mask="0xF"/>
          <bitfield name="SIZE" caption="4KB count" mask="0xF0"/>
        </register>
        <register name="PIDR5" offset="0xFD4" rw="R" size="4" access-size="4" initval="0x00000000" caption="TPIU Peripheral Identification Register 5">
        </register>
        <register name="PIDR6" offset="0xFD8" rw="R" size="4" access-size="4" initval="0x00000000" caption="TPIU Peripheral Identification Register 6">
        </register>
        <register name="PIDR7" offset="0xFDC" rw="R" size="4" access-size="4" initval="0x00000000" caption="TPIU Peripheral Identification Register 7">
        </register>
        <register name="PIDR0" offset="0xFE0" rw="R" size="4" access-size="4" caption="TPIU Peripheral Identification Register 0">
          <bitfield name="PART_0" caption="Part number bits[7:0]" mask="0xFF"/>
        </register>
        <register name="PIDR1" offset="0xFE4" rw="R" size="4" access-size="4" caption="TPIU Peripheral Identification Register 1">
          <bitfield name="PART_1" caption="Part number bits[11:8]" mask="0xF"/>
          <bitfield name="DES_0" caption="JEP106 identification code bits [3:0]" mask="0xF0"/>
        </register>
        <register name="PIDR2" offset="0xFE8" rw="R" size="4" access-size="4" caption="TPIU Peripheral Identification Register 2">
          <bitfield name="DES_1" caption="JEP106 identification code bits[6:4]" mask="0x7"/>
          <bitfield name="JEDEC" caption="JEDEC assignee value is used" mask="0x8"/>
          <bitfield name="REVISION" caption="Component revision" mask="0xF0"/>
        </register>
